app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
---
  def index
    @songs = Song.all

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @song = Song.find(params[:id])